
  {
   "intents": [
      {
         "tag": "greeting",
         "patterns": [
            "Hi", "Hello", "Hey", "Good morning", "Good evening", "Is anyone there?", "Hello bot"
         ],
         "responses": [
            "Hello! How can I assist you today?",
            "Hi there! I'm here to help with any health concerns you might have.",
            "Greetings! How may I support you today?"
         ]
      },
      {
         "tag": "symptom_inquiry",
         "patterns": [
            "I have a headache", "I'm feeling nauseous", "I have a sore throat", "I'm experiencing fatigue",
            "What does a cough mean?", "I feel dizzy", "I have body aches", "I'm sneezing a lot"
         ],
         "responses": [
            "I’m sorry to hear that. Could you tell me if you have other symptoms?",
            "How long have you been feeling this way?",
            "Do you have any additional symptoms, such as fever, chills, or sore throat?"
         ],
         "context_set": "symptom_inquiry"
      },
      {
         "tag": "cold_flu_symptoms",
         "patterns": [
            "I think I have the flu", "I have a runny nose and cough", "I'm sneezing and have a sore throat",
            "I feel feverish and tired", "Could this be a cold?"
         ],
         "responses": [
            "It sounds like you may have cold or flu symptoms. Rest, hydration, and over-the-counter medications might help. Consider seeing a doctor if symptoms worsen.",
            "These symptoms are common with cold and flu. Ensure you rest and drink plenty of fluids. If your temperature goes up or you feel worse, consult a healthcare provider."
         ],
         "context_set": "cold_flu_symptoms"
      },
      {
         "tag": "covid_symptoms",
         "patterns": [
            "I think I have COVID", "I lost my sense of smell", "I have a fever and dry cough",
            "I'm having trouble breathing", "Do I have coronavirus symptoms?"
         ],
         "responses": [
            "If you're experiencing symptoms like fever, dry cough, loss of smell or taste, or difficulty breathing, please get tested for COVID-19 and self-isolate. Seek immediate medical care if you have trouble breathing.",
            "Your symptoms may be related to COVID-19. It's recommended you get tested and follow local health guidelines for isolation."
         ]
      },
      {
         "tag": "allergy_symptoms",
         "patterns": [
            "I'm sneezing a lot", "My eyes are itchy", "I have a stuffy nose", "I think I have allergies",
            "I'm experiencing seasonal allergies"
         ],
         "responses": [
            "Allergy symptoms can include sneezing, itchy eyes, and a runny nose. Over-the-counter antihistamines may help. Consult a doctor if symptoms persist.",
            "These could be allergy symptoms. Try staying indoors on high pollen days and consider allergy medication if needed."
         ],
         "context_set": "allergy_symptoms"
      },
      {
         "tag": "indigestion_symptoms",
         "patterns": [
            "I have indigestion", "I'm feeling bloated", "I have stomach cramps", "I feel full after eating little",
            "I have acid reflux", "I feel discomfort after eating"
         ],
         "responses": [
            "Indigestion can cause bloating, stomach cramps, and acid reflux. Home remedies like drinking ginger tea, avoiding greasy foods, and eating smaller meals may help.",
            "For indigestion, avoid spicy or fatty foods and try drinking chamomile tea or taking an over-the-counter antacid."
         ],
         "treatment": {
            "medication": [
               "Antacids like Tums, Pepto-Bismol, or Mylanta can provide relief.",
               "H2 blockers (e.g., ranitidine) and proton pump inhibitors (PPIs) like omeprazole may be prescribed if symptoms are frequent."
            ],
            "home_remedies": [
               "Drink ginger or peppermint tea.",
               "Eat smaller, more frequent meals.",
               "Avoid foods that trigger acid reflux, such as citrus or spicy foods.",
               "Lie down with your head elevated after eating."
            ]
         }
      },
      {
         "tag": "migraine_symptoms",
         "patterns": [
            "I have a severe headache", "I'm sensitive to light and sound", "I think I'm having a migraine",
            "I feel nauseous with a headache"
         ],
         "responses": [
            "Migraines can be intense and are often accompanied by nausea and sensitivity to light. Rest in a quiet, dark room and consider over-the-counter pain relievers.",
            "Migraines may require prescription medications if they are frequent or severe. Try avoiding triggers such as bright lights or loud noises."
         ],
         "treatment": {
            "medication": [
               "Over-the-counter pain relievers like ibuprofen or acetaminophen can help.",
               "Prescription medications like triptans (e.g., sumatriptan) may be used for severe migraines."
            ],
            "home_remedies": [
               "Lie down in a dark room to reduce light sensitivity.",
               "Apply a cold or warm compress to your forehead.",
               "Drink plenty of water to stay hydrated."
            ]
         }
      },
      {
         "tag": "stomach_issues",
         "patterns": [
            "I have a stomach ache", "I'm feeling nauseous", "I have diarrhea", "I'm experiencing indigestion",
            "My stomach feels upset"
         ],
         "responses": [
            "Stomach issues can result from various causes. Avoid heavy meals and drink clear fluids. If symptoms worsen, consult a healthcare provider.",
            "An upset stomach can often be managed with rest, hydration, and avoiding spicy or greasy foods. Seek medical advice if symptoms continue."
         ],
         "treatment": {
            "medication": [
               "Antacids and proton pump inhibitors (PPIs) for acidity.",
               "Anti-diarrheal medications like loperamide (Imodium).",
               "Antiemetics like ondansetron or dimenhydrinate for nausea."
            ],
            "home_remedies": [
               "Drink ginger tea to settle the stomach.",
               "Eat small amounts of bland foods, such as toast or crackers.",
               "Stay hydrated with clear liquids like water, broths, or oral rehydration solutions."
            ]
         }
      },
      {
         "tag": "pain_symptoms",
         "patterns": [
            "I have a sharp pain", "My back hurts", "I have joint pain", "I feel muscle pain",
            "I have pain in my stomach"
         ],
         "responses": [
            "Pain can result from various causes. For muscular pain, gentle stretching or hot compresses might help. For joint pain, over-the-counter anti-inflammatory medications might be useful.",
            "If you experience severe pain, it is advisable to consult a doctor for proper diagnosis and treatment."
         ],
         "treatment": {
            "medication": [
               "Nonsteroidal anti-inflammatory drugs (NSAIDs) like ibuprofen or naproxen for pain relief.",
               "Topical analgesics like lidocaine or capsaicin creams for localized pain."
            ],
            "home_remedies": [
               "Apply a warm or cold compress to the affected area.",
               "For muscle pain, try gentle massage or stretching.",
               "Rest and avoid putting stress on the painful area."
            ]
         }
      },
      {
         "tag": "mental_health",
         "patterns": [
            "I'm feeling anxious", "I feel depressed", "I'm experiencing stress", "I have trouble sleeping",
            "I feel overwhelmed"
         ],
         "responses": [
            "Mental health is important. Consider talking to someone you trust or a mental health professional. Practices like meditation and breathing exercises may also help.",
            "Anxiety and stress can take a toll. Try to focus on self-care and reach out to a mental health specialist if needed."
         ]
      },
      {
         "tag": "recommend_doctor",
         "patterns": [
            "Can you suggest a doctor?", "Any specialists in Kolkata?", "Recommend a physician near me in Kolkata",
           "Suggest Doctors","Help me with Doctors",
            "Find me a doctor in Kolkata", "Need a recommendation for a specialist"
         ],
         "responses": [
            "Here are some doctors in Kolkata:\n1. Dr. Arjun Roy - General Physician at Apollo Gleneagles Hospital\n2. Dr. Sharmila Sen - ENT Specialist at Fortis Hospital\n3. Dr. Ravi Banerjee - Cardiologist at AMRI Hospitals\n4. Dr. Priya Mukherjee - Pediatrician at Columbia Asia Hospital",
            "You may consider these doctors in Kolkata:\n- Dr. Anirban Das, Internal Medicine at Medica Superspecialty Hospital\n- Dr. Suman Sen, Gastroenterologist at Peerless Hospital\n- Dr. Priyanka Sarkar, Dermatologist at Ruby General Hospital"
         ]
      },
      {
         "tag": "next_steps",
         "patterns": [
            "What should I do next?", "Give me next steps", "What to do now?", "What should I do to get better?"
         ],
         "responses": [
            "Please follow the treatment options based on your symptoms. If they persist or worsen, it's a good idea to consult with a healthcare professional."
         ]
      },
    {
      "tag": "headache",
      "patterns": [
        "I have a headache",
        "My head hurts",
        "I'm feeling a headache",
        "I have a migraine",
        "My temples hurt",
        "I'm having a headache"
      ],
      "responses": [
        "Headaches can be caused by stress, dehydration, or lack of sleep.You can take pain relievers like Ibuprofen, Acetaminophen (Tylenol), or Aspirin.",
        "Headaches can also be caused by tension, or they could be a sign of something more serious like a migraine.\nTry applying a cold compress to your forehead.If it's a migraine, you can try medications like triptans."

      ]
    },
    {
      "tag": "cold",
      "patterns": [
        "I have a cold",
        "I feel congested",
        "I'm sneezing a lot",
        "My nose is blocked",
        "I have a stuffy nose",
        "I have a runny nose, sneezing, and coughing"
      ],
      "responses": [
        "A cold is often caused by a viral infection. Symptoms include a stuffy or runny nose, sneezing, and coughing.You can take decongestants or antihistamines like Zyrtec or Sudafed.",
        "It’s very common during the winter months, and it can make you feel miserable.Gargle with salt water to relieve sore throat and use a humidifier to keep your airways moist and ease congestion."
      ]
    },
    {
      "tag": "flu",
      "patterns": [
        "I have the flu",
        "I'm feeling sick",
        "I have body aches",
        "I feel feverish",
        "I'm shivering a lot"
      ],
      "responses": [
        "The flu is a viral infection that causes fever, body aches, and fatigue.Antiviral medications like Tamiflu can reduce symptoms if taken early.\"",
        "It's more severe than a common cold and can lead to complications, especially in vulnerable individuals.Rest in bed and drink plenty of fluids to stay hydrated."
      ]
    },
    {
      "tag": "indigestion",
      "patterns": [
        "I have indigestion",
        "I feel bloated",
        "My stomach hurts",
        "I have acid reflux",
        "I feel discomfort in my stomach",
        "I have acidity in stomach",
        "I have gas"
      ],
      "responses": [
        "Indigestion can be caused by overeating or eating spicy food.You can take antacids like Tums, Maalox, or H2 blockers like Zantac for relief.",
        "It often leads to discomfort, bloating, or burning sensations in the stomach.Ginger tea or chewing on ginger pieces can also relieve symptoms."
      ]
    },
    {
      "tag": "fever",
      "patterns": [
        "I have a fever",
        "I feel hot",
        "I'm running a temperature",
        "I'm feeling feverish"
      ],
      "responses": [
        "A fever usually means your body is fighting an infection.\nYou can take fever-reducing medications like Tylenol (acetaminophen) or Ibuprofen.Drink plenty of fluids to prevent dehydration.",
        "Fever can be caused by viral infections, bacterial infections, or other health conditions.\nIn some cases, if the fever is high, you may need medical attention.Rest and avoid exerting yourself until the fever passes."
      ]
    },
    {
      "tag": "stress",
      "patterns": [
        "I'm feeling stressed",
        "I'm overwhelmed",
        "I'm anxious",
        "I'm under a lot of pressure",
        "I feel nervous"
      ],
      "responses": [
        "Stress can be caused by various factors, including work, personal issues, or financial troubles.Consider practicing relaxation techniques like meditation, yoga, or deep breathing exercises.",
        "It's important to manage stress to avoid physical or emotional exhaustion.If stress is overwhelming, it may be useful to speak with a counselor or therapist."
      ]
    },
    {
      "tag": "cough",
      "patterns": [
        "I have a cough",
        "I'm coughing a lot",
        "My throat is irritated",
        "I'm hacking up a lung"
      ],
      "responses": [
        "Coughing can be caused by a variety of things like a cold, flu, or allergies.Cough suppressants like Dextromethorphan or Robitussin can reduce coughing.",
        "It’s your body's way of clearing the throat or airways.Expectorants like Mucinex can help loosen mucus."
      ]
    },
    {
      "tag": "back_pain",
      "patterns": [
        "My back hurts",
        "I have back pain",
        "I feel pain in my back",
        "My lower back is sore"
      ],
      "responses": [
        "Back pain is a common issue that can be caused by muscle strain, poor posture, or even stress.Over-the-counter pain relievers like Ibuprofen or Naproxen can help.",
        "Chronic back pain may require medical attention if it's persistent.Physical therapy or seeing a chiropractor can help manage back pain."
      ]
    },
    {
      "tag": "allergy",
      "patterns": [
        "I have allergies",
        "I'm allergic to pollen",
        "I can't stop sneezing",
        "My eyes are itchy"
      ],
      "responses": [
        "Allergies are caused by the immune system reacting to foreign substances.","You can take antihistamines like Claritin, Zyrtec, or Benadryl.",
        "Common allergens include pollen, dust, mold, and pet dander.Nasal sprays like Flonase can help relieve nasal congestion."
      ]
    },
      {
         "tag": "farewell",
         "patterns": [
            "Thank you", "Thanks", "Bye", "Goodbye", "See you later", "Take care"
         ],
         "responses": [
            "You're welcome! Take care and feel free to reach out if you have more questions.",
            "Thank you for chatting with me! Take care and stay healthy.",
            "Goodbye! I am here whenever you need medical advice."
         ]
      },
      {
         "tag": "default_response",
         "patterns": [],
         "responses": [
            "I'm sorry, I didn't quite understand that. Could you rephrase?",
            "Can you clarify your question? I’ll do my best to help."
         ]
      }
  ]
}
